using System;

/*
Написать метод для вычисления приближенного значения n-го члена ряда Фибоначчи по формуле Бине:

𝑈_𝑛=(𝑏^𝑛−(〖−𝑏〗^(−𝑛) ))/(2𝑏−1)
𝑏=(1+√5)/2

В основной программе, вводя с помощью метода int.TryParse() значения n, вычислять и 
выводить приближенное вещественное значение n-го члена ряда Фибоначчи. 
Окончание работы программы – ввод нулевого или отрицательного значения n. 
 */

class Program
{
    static void Main()
    {
        uint n;            // Номер члена ряда   
        double b,          // Вспомогательная переменная
               un;         // Оценка по формуле Бине
        int res;           // Целочисленное значение члена 
        string line;       // Строка для приёма данных 

        Console.Write("Введите номер члена ряда: ");
        line = Console.ReadLine();
        if (!uint.TryParse(line, out n))
        {
            Console.WriteLine("Ошибка ввода!");
            return;
        }

        b = (1 + Math.Sqrt(5)) / 2;
        un = (Math.Pow(b, n) - Math.Pow(-b, -n)) / (2 * b - 1);
        res = (int)(un + 0.5);

        Console.WriteLine("un = " + un + ", число Фибоначчи: " + res);

        Console.WriteLine("Для выхода из программы нажмите ENTER.");
        Console.ReadLine();
    } //Конец определения метода Main()
} //Конец объявления класса Program
