using System;

/*
   Дисциплина: "Программирование"
   Группа:      101ПИ/1
   Студент:     Иванов Иван Иванович
   Задача:      Написать метод для вычисления площади и длины окружности, радиус которой задает 
   вещественный параметр. 
   В основной программе, вводя значения радиуса, с помощью обращения к методу, вычислять площадь 
   и длину окружности. При вводе применять метод double.TryParse() и проверять корректность 
   введенного значения. При выводе использовать форматную строку метода WriteLine(). 
   Окончание работы программы – ввод нулевого или отрицательного значения радиуса.    
   Дата:        2015.09.17
*/


class Program
{
    public static double Square(double r, out double len)
    {
        len = 2 * Math.PI * r;
        return Math.PI * r * r;
    } //Конец определения Square()

    public static void Main()
    {
        double r, //радиус
          s, // площадь круга
          c;  // длина окружности        
        string str;    // Рабочая строка для ввода и вывода данных 
        do
        {                  // цикл для повторения решения
            do {
                Console.Write("Введите радиус: ");
                str = Console.ReadLine();         //Читаем символьную строку 
            } while (!double.TryParse(str, out r) || r <= 0); //Преобразуем строку в число 

            s = Square(r, out c);

            Console.WriteLine("Площадь: " + s.ToString("f3"));
            Console.WriteLine("Длина окружности: " + c.ToString("f3"));
            Console.WriteLine("Для выхода из программы нажмите ESC.");
        } while (Console.ReadKey(true).Key != ConsoleKey.Escape);
    } //Конец определения метода
} //Конец объявления класса


