using System;

/*
3.1. Написать метод, формирующий и возвращающий массив из N членов разложения в ряд функции sin(1):  
	sin(x)= x - x3/3! + x5/5! - ... 
Параметр N – число требуемых членов ряда.

3.2. Написать метод для вычисления sin(х) для заданного х с использованием массива членов ряда sin(1). 
Параметры: ссылка на массив разложения sin(1) и аргумент х.
 
3.3. В основной программе ввести значение N вычислить массив sin(1). Вводя, последовательно вводя, 
значения х, вычислять sin(х) как с помощью созданного метода, так и с использованием библиотечного 
метода Math.Sin(). Сравнить результаты. 
*/
class Program
{
    static void Main(string[] args)
    {
        // Переменные программы:
        double angle,   // Введенный угол в радианах
               x,         // Аргумент x (приведенный угол)
               sin,       // Сумма ряда (текущая)
               sinOld,    // Сумма ряда (предыдущая)
               memb;      // Очередной член ряда 

        do
        {
            Console.Write("Введите значение угла: ");
        }
        while (!double.TryParse(Console.ReadLine(), out angle) || angle <= 0);

        x = angle % (2 * Math.PI);    // приведение угла
                                      // Цикл вычисления суммы ряда (след. слайд)
                                      // Вывод результатов (angle, sin) 
                                      // Вывод  значения Math.Sin(angle)
                                      // Завершение кода программы

        int m; // число просуммированных членов ряда        
        for (m = 1, sin = memb = x, sinOld = 0; sin != sinOld; m++)
        {
            Console.WriteLine("sin({0})={1} or = {2} \tmemb = {3}", x, sin, Math.Sin(x), memb);
            sinOld = sin;
            memb *= -x * x / 2 / m / (2 * m + 1);
            sin += memb;
        }
        Console.ReadKey();
    }
}
